In [1]:
![01](01.png)   #이미지 불러오기

'[01]'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

https://www.youtube.com/ 유튜브 보러가기

In [3]:
import pandas as pd

In [6]:
dates = pd.date_range('20190301', periods=7)

In [7]:
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06', '2019-03-07'],
              dtype='datetime64[ns]', freq='D')

In [8]:
import numpy as np

In [10]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['A', 'B', 'C', 'D'])

In [11]:
df

                   A         B         C         D
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-02  0.977878 -1.009530  0.761006 -0.656981
2019-03-03  0.830148 -1.452188  1.077017 -0.869515
2019-03-04  0.673236  1.622835 -0.169274  1.496602
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277
2019-03-06 -2.109116 -1.789858  0.801402  1.351207
2019-03-07  0.518756  0.098875  1.629327  1.427887

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06', '2019-03-07'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.values

array([[ 0.47799216,  0.27903712,  0.4383737 , -0.1042642 ],
       [ 0.97787786, -1.00953003,  0.76100603, -0.65698091],
       [ 0.83014845, -1.45218792,  1.07701705, -0.86951482],
       [ 0.67323631,  1.62283455, -0.16927412,  1.49660248],
       [-0.85469619, -0.29919828, -0.23542024,  0.66827708],
       [-2.1091156 , -1.78985807,  0.80140188,  1.35120669],
       [ 0.51875551,  0.09887484,  1.62932729,  1.42788675]])

In [18]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean   0.073457 -0.364290  0.614633  0.473316
std    1.135585  1.170000  0.666818  1.015003
min   -2.109116 -1.789858 -0.235420 -0.869515
25%   -0.188352 -1.230859  0.134550 -0.380623
50%    0.518756 -0.299198  0.761006  0.668277
75%    0.751692  0.188956  0.939209  1.389547
max    0.977878  1.622835  1.629327  1.496602

In [20]:
df.sort_values(by='A')  #A 기준 올림차순

                   A         B         C         D
2019-03-06 -2.109116 -1.789858  0.801402  1.351207
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-07  0.518756  0.098875  1.629327  1.427887
2019-03-04  0.673236  1.622835 -0.169274  1.496602
2019-03-03  0.830148 -1.452188  1.077017 -0.869515
2019-03-02  0.977878 -1.009530  0.761006 -0.656981

In [21]:
df.sort_values(by='A', ascending=False)  #내림차순

                   A         B         C         D
2019-03-02  0.977878 -1.009530  0.761006 -0.656981
2019-03-03  0.830148 -1.452188  1.077017 -0.869515
2019-03-04  0.673236  1.622835 -0.169274  1.496602
2019-03-07  0.518756  0.098875  1.629327  1.427887
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277
2019-03-06 -2.109116 -1.789858  0.801402  1.351207

In [22]:
df['A']

2019-03-01    0.477992
2019-03-02    0.977878
2019-03-03    0.830148
2019-03-04    0.673236
2019-03-05   -0.854696
2019-03-06   -2.109116
2019-03-07    0.518756
Freq: D, Name: A, dtype: float64

In [32]:
type(df['A'])

pandas.core.series.Series

데이터 값 불러오기

In [24]:
df[0:3]

                   A         B         C         D
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-02  0.977878 -1.009530  0.761006 -0.656981
2019-03-03  0.830148 -1.452188  1.077017 -0.869515

In [25]:
df.loc['2019-03-01']    #index를 불러옴

A    0.477992
B    0.279037
C    0.438374
D   -0.104264
Name: 2019-03-01 00:00:00, dtype: float64

In [26]:
df.loc['2019-03-05']

A   -0.854696
B   -0.299198
C   -0.235420
D    0.668277
Name: 2019-03-05 00:00:00, dtype: float64

In [27]:
df.loc['2019-03-01', 'A']

0.4779921567113118

In [28]:
df.loc['2019-03-01', ['A', 'D']]

A    0.477992
D   -0.104264
Name: 2019-03-01 00:00:00, dtype: float64

In [30]:
df.loc['2019-03-06', ['A', 'B', 'D']]

A   -2.109116
B   -1.789858
D    1.351207
Name: 2019-03-06 00:00:00, dtype: float64

In [31]:
df.loc['2019-03-01':'2019-3-06', ['A', 'D']]  #전까지가 아니라 그 값까지 불러옴

                   A         D
2019-03-01  0.477992 -0.104264
2019-03-02  0.977878 -0.656981
2019-03-03  0.830148 -0.869515
2019-03-04  0.673236  1.496602
2019-03-05 -0.854696  0.668277
2019-03-06 -2.109116  1.351207

In [33]:
df.loc[:, ['A', 'C']]

                   A         C
2019-03-01  0.477992  0.438374
2019-03-02  0.977878  0.761006
2019-03-03  0.830148  1.077017
2019-03-04  0.673236 -0.169274
2019-03-05 -0.854696 -0.235420
2019-03-06 -2.109116  0.801402
2019-03-07  0.518756  1.629327

In [35]:
df.loc['2019-03-05':, ['A', 'B']]

                   A         B
2019-03-05 -0.854696 -0.299198
2019-03-06 -2.109116 -1.789858
2019-03-07  0.518756  0.098875

In [36]:
df.iloc[0:2]  #숫자로 하는 loc

                   A         B         C         D
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-02  0.977878 -1.009530  0.761006 -0.656981

In [37]:
df.iloc[:-1]

                   A         B         C         D
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-02  0.977878 -1.009530  0.761006 -0.656981
2019-03-03  0.830148 -1.452188  1.077017 -0.869515
2019-03-04  0.673236  1.622835 -0.169274  1.496602
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277
2019-03-06 -2.109116 -1.789858  0.801402  1.351207

In [38]:
df.iloc[0:, 0:2]

                   A         B
2019-03-01  0.477992  0.279037
2019-03-02  0.977878 -1.009530
2019-03-03  0.830148 -1.452188
2019-03-04  0.673236  1.622835
2019-03-05 -0.854696 -0.299198
2019-03-06 -2.109116 -1.789858
2019-03-07  0.518756  0.098875

In [39]:
df.iloc[0:3, :]

                   A         B         C         D
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-02  0.977878 -1.009530  0.761006 -0.656981
2019-03-03  0.830148 -1.452188  1.077017 -0.869515

In [40]:
df.iloc[[0,2,5],0:2]  #각각 가져오기 위한 iloc

                   A         B
2019-03-01  0.477992  0.279037
2019-03-03  0.830148 -1.452188
2019-03-06 -2.109116 -1.789858

In [41]:
df.values

array([[ 0.47799216,  0.27903712,  0.4383737 , -0.1042642 ],
       [ 0.97787786, -1.00953003,  0.76100603, -0.65698091],
       [ 0.83014845, -1.45218792,  1.07701705, -0.86951482],
       [ 0.67323631,  1.62283455, -0.16927412,  1.49660248],
       [-0.85469619, -0.29919828, -0.23542024,  0.66827708],
       [-2.1091156 , -1.78985807,  0.80140188,  1.35120669],
       [ 0.51875551,  0.09887484,  1.62932729,  1.42788675]])

In [42]:
df['A']>0

2019-03-01     True
2019-03-02     True
2019-03-03     True
2019-03-04     True
2019-03-05    False
2019-03-06    False
2019-03-07     True
Freq: D, Name: A, dtype: bool

In [43]:
df[df['A']>0]

                   A         B         C         D
2019-03-01  0.477992  0.279037  0.438374 -0.104264
2019-03-02  0.977878 -1.009530  0.761006 -0.656981
2019-03-03  0.830148 -1.452188  1.077017 -0.869515
2019-03-04  0.673236  1.622835 -0.169274  1.496602
2019-03-07  0.518756  0.098875  1.629327  1.427887

In [44]:
df[df['D']>0]

                   A         B         C         D
2019-03-04  0.673236  1.622835 -0.169274  1.496602
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277
2019-03-06 -2.109116 -1.789858  0.801402  1.351207
2019-03-07  0.518756  0.098875  1.629327  1.427887

In [45]:
df>0

                A      B      C      D
2019-03-01   True   True   True  False
2019-03-02   True  False   True  False
2019-03-03   True  False   True  False
2019-03-04   True   True  False   True
2019-03-05  False  False  False   True
2019-03-06  False  False   True   True
2019-03-07   True   True   True   True

In [46]:
df[df>0]

                   A         B         C         D
2019-03-01  0.477992  0.279037  0.438374       NaN
2019-03-02  0.977878       NaN  0.761006       NaN
2019-03-03  0.830148       NaN  1.077017       NaN
2019-03-04  0.673236  1.622835       NaN  1.496602
2019-03-05       NaN       NaN       NaN  0.668277
2019-03-06       NaN       NaN  0.801402  1.351207
2019-03-07  0.518756  0.098875  1.629327  1.427887

In [47]:
df2 = pd.DataFrame(df, columns=['A', 'C', 'D', 'B'])
df2

                   A         C         D         B
2019-03-01  0.477992  0.438374 -0.104264  0.279037
2019-03-02  0.977878  0.761006 -0.656981 -1.009530
2019-03-03  0.830148  1.077017 -0.869515 -1.452188
2019-03-04  0.673236 -0.169274  1.496602  1.622835
2019-03-05 -0.854696 -0.235420  0.668277 -0.299198
2019-03-06 -2.109116  0.801402  1.351207 -1.789858
2019-03-07  0.518756  1.629327  1.427887  0.098875

In [48]:
df['E'] = np.nan

In [49]:
df

                   A         B         C         D   E
2019-03-01  0.477992  0.279037  0.438374 -0.104264 NaN
2019-03-02  0.977878 -1.009530  0.761006 -0.656981 NaN
2019-03-03  0.830148 -1.452188  1.077017 -0.869515 NaN
2019-03-04  0.673236  1.622835 -0.169274  1.496602 NaN
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277 NaN
2019-03-06 -2.109116 -1.789858  0.801402  1.351207 NaN
2019-03-07  0.518756  0.098875  1.629327  1.427887 NaN

In [50]:
df2

                   A         C         D         B
2019-03-01  0.477992  0.438374 -0.104264  0.279037
2019-03-02  0.977878  0.761006 -0.656981 -1.009530
2019-03-03  0.830148  1.077017 -0.869515 -1.452188
2019-03-04  0.673236 -0.169274  1.496602  1.622835
2019-03-05 -0.854696 -0.235420  0.668277 -0.299198
2019-03-06 -2.109116  0.801402  1.351207 -1.789858
2019-03-07  0.518756  1.629327  1.427887  0.098875

In [52]:
df.loc['2019-03-02', 'E'] =2  #특정 값 집어넣기

In [53]:
df

                   A         B         C         D    E
2019-03-01  0.477992  0.279037  0.438374 -0.104264  NaN
2019-03-02  0.977878 -1.009530  0.761006 -0.656981  2.0
2019-03-03  0.830148 -1.452188  1.077017 -0.869515  NaN
2019-03-04  0.673236  1.622835 -0.169274  1.496602  NaN
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277  NaN
2019-03-06 -2.109116 -1.789858  0.801402  1.351207  NaN
2019-03-07  0.518756  0.098875  1.629327  1.427887  NaN

In [54]:
df['F']=df['A']+df['B']

In [55]:
df

                   A         B         C         D    E         F
2019-03-01  0.477992  0.279037  0.438374 -0.104264  NaN  0.757029
2019-03-02  0.977878 -1.009530  0.761006 -0.656981  2.0 -0.031652
2019-03-03  0.830148 -1.452188  1.077017 -0.869515  NaN -0.622039
2019-03-04  0.673236  1.622835 -0.169274  1.496602  NaN  2.296071
2019-03-05 -0.854696 -0.299198 -0.235420  0.668277  NaN -1.153894
2019-03-06 -2.109116 -1.789858  0.801402  1.351207  NaN -3.898974
2019-03-07  0.518756  0.098875  1.629327  1.427887  NaN  0.617630

In [63]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\sp501_14\anaconda3\lib\site-packages (2.0.1)

In [105]:
pd.read_excel("./data/teen.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [115]:
pd.read_excel("./data/teen.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [119]:
pd.read_excel("./data/teen.xls", header=1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2020  구분  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [120]:
pd.read_excel("./data/teen.xls", header=1, usecols="C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [121]:
col_names=['스트레스', '스트레스남학생', '스트레스여학생', '우울감경험율', '우울남학생', '우울여학생', '자살생각율', '자살남학생','자살여학생']

pd.read_excel("./data/teen.xls", header=1, usecols="C:K", names=col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [122]:
raw_data = pd.read_excel("./data/teen.xls", usecols="C:K", names=col_names)
raw_data

   스트레스 스트레스남학생 스트레스여학생 우울감경험율 우울남학생 우울여학생 자살생각율 자살남학생 자살여학생
0    전체     남학생     여학생     전체   남학생   여학생    전체   남학생   여학생
1  35.1    29.8    40.8   25.4  21.2  29.9  11.2   8.8  13.8

In [124]:
col_names=['스트레스', '스트레스남학생', '스트레스여학생', '우울감경험율', '우울남학생', '우울여학생', '자살생각율', '자살남학생','자살여학생']

pd.read_excel("./data/teen.xls", header=1, usecols="C:K", names=col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [129]:
pd.read_excel("./data/teen.xls",header=2, usecols="C:K", names=col_names)

Empty DataFrame
Columns: [스트레스, 스트레스남학생, 스트레스여학생, 우울감경험율, 우울남학생, 우울여학생, 자살생각율, 자살남학생, 자살여학생]
Index: []